{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "67c33f49",
   "metadata": {},
   "source": [
    "## Задачи с типами данных"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "94e9a205",
   "metadata": {},
   "source": [
    "**1. Напишите программу, которая будет запрашивать у пользователя его любимые фильмы или сериалы в виде словаря, затем в виде другого словаря внутрь необходимо передать название, год выпуска, имя режиссера и имя главного героя.**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c891251c",
   "metadata": {},
   "source": [
    "Пример данных в программе:\n",
    "```\n",
    "Введите информацию о первом фильме:\n",
    "Название: Зеленая миля\n",
    "Год выпуска: 1999\n",
    "Режиссер: Фрэнк Дарабонт\n",
    "Главный герой: Пол Эджкомб\n",
    "\n",
    "Введите информацию о втором фильме:\n",
    "Название: Криминальное чтиво\n",
    "Год выпуска: 1994\n",
    "Режиссер: Квентин Тарантино\n",
    "Главный герой: Винсент Вега\n",
    "\n",
    "Введите информацию о своем любимом сериале:\n",
    "Название: Игра престолов\n",
    "Год выпуска: 2011\n",
    "Режиссер: Дэвид Бениофф\n",
    "Главные герои: Джон Сноу, Ария Старк, Тирион Ланнистер\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ce7ea597",
   "metadata": {},
   "outputs": [],
   "source": [
    "#не уверен что правильно понял задание\n",
    "dict_ = {}\n",
    "i = 0\n",
    "a = ''\n",
    "while a != '0':\n",
    "    i += 1\n",
    "    print('Введите информацию фильме: \\n')\n",
    "    n = input('Название')\n",
    "    y = input('Год выпуска:')\n",
    "    r = input('Режиссер:')\n",
    "    g = input('Главный герой:')\n",
    "    dict_[i] = {'Название': n, 'Год выпуска': y, 'Режиссер': r, 'Главный герой': g,}\n",
    "    a = input('Если не хотите больше вводить, напишите 0:')\n",
    "print(dict_)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "12a5a06b",
   "metadata": {},
   "source": [
    "## Условный оператор if...else"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "230cbdb2",
   "metadata": {},
   "source": [
    "**2. Напишите программу, которая на вход будет получать количество отработанных часов сотрудника и показатель производительности (воспользуйтесь методом `input`, изучите его самостоятельно, он предназначен для того, чтобы значения в него закладывались после выполнения ячейки с кодом). Количество отработанных часов должно быть не менее 40, а показатель производительности положительным, в случае удовлетворения необходимо посчитать эффективность работы сотрудника перемножив `время` * `производительность`, иначе же необходимо вывести замечание сотруднику**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dd4da58f",
   "metadata": {},
   "source": [
    "Пример результата:"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "eeddc572",
   "metadata": {},
   "source": [
    "```\n",
    "Введите количество отработанных часов: 42\n",
    "Введите показатель производительности: 5\n",
    "Эффективность работы сотрудника составляет 210.0 единиц в час\n",
    "```\n",
    "```\n",
    "Введите количество отработанных часов: 38\n",
    "Введите показатель производительности: 5\n",
    "Количество часов должно быть больше 40\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ba36355b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def is_number (str_):\n",
    "    try:\n",
    "        float(str_)\n",
    "        return True\n",
    "    except:\n",
    "        return False\n",
    "a = input('Введите количество отработанных часов:')\n",
    "while not is_number(a):\n",
    "    print(f'Вы ввели не число.')\n",
    "    a = input(\"Введите количество отработанных часов:\")\n",
    "\n",
    "b = input('Введите показатель производительности:')\n",
    "while not is_number(b):\n",
    "    print(f'Вы ввели не число.')\n",
    "    b = input(\"Введите показатель производительности:\")\n",
    "if int(a) >= 40 and int(b) > 0:\n",
    "    print(f'Эффективность работы сотрудника составляет {int(a) * int(b)} единиц в час')\n",
    "else: \n",
    "    print('Плохо работаете, уважаемый')    \n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5be4d9fe",
   "metadata": {},
   "source": [
    "##  Цикл For"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "04cbf8b6",
   "metadata": {},
   "source": [
    "**3. Напишите программу, которая после выполнения выдает список значений, удовлетворяющих теореме Пифагора (Переберите все возможные комбинации, где сумма всех чисел будет меньше 50)**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bb7f3590",
   "metadata": {},
   "outputs": [],
   "source": [
    "import math\n",
    "for a in range(1, 50):\n",
    "    for b in range(1, 50):\n",
    "        c = round(math.sqrt(a**2 + b**2), 2)\n",
    "        if (a + b + c) < 50:\n",
    "            list_ = [a, b, c]\n",
    "            print(list_)\n",
    "        else:\n",
    "             break"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1a3a722c",
   "metadata": {},
   "source": [
    "##  Функции"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "698f1fa3",
   "metadata": {},
   "source": [
    "**4. Напишите функцию для поиска наименьшего общего кратного (НОК) двух чисел. Функция должна принимать на вход два параметра и возвращать наименьшее общее кратное этих чисел**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c3481833",
   "metadata": {},
   "outputs": [],
   "source": [
    "def nok (a, b):\n",
    "    if a < b:\n",
    "        i = b\n",
    "    else:\n",
    "        i = a\n",
    "    while True:\n",
    "        if i % a == 0 and i % b == 0:\n",
    "            break\n",
    "        else:\n",
    "            i += 1\n",
    "\n",
    "    return i\n",
    "\n",
    "print(nok(14,6))\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8e36e261",
   "metadata": {},
   "outputs": [],
   "source": [
    "#хотя уже есть встроенная функция\n",
    "import math\n",
    "\n",
    "print(math.lcm(14, 6))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ba4763a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
